### CONNECTING POSTGRES TO JUPYTER

In [132]:
#!pip install ipython-sql
#!pip install sqlalchemy
#!pip install psycopg2

In [74]:
%load_ext sql
from sqlalchemy import create_engine

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [75]:
%sql postgresql://postgres:m0tunray0.@localhost/10acad_moodle

In [76]:
engine = create_engine('postgresql://postgres:m0tunray0.@localhost/10acad_moodle')

### QUERY DATABASE

#### Number of Tables in the Database

In [77]:
%%sql
SELECT count(*) AS TOTALNUMBEROFTABLES
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_SCHEMA = 'public'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(448,)]

#### The number of records(rows) in each of the tables given in the MIT section

In [48]:
%%sql
SELECT COUNT(*) FROM mdl_logstore_standard_log

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(417554,)]

In [79]:
%%sql
SELECT *
FROM mdl_logstore_standard_log
LIMIT 10

 * postgresql://postgres:***@localhost/10acad_moodle
10 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None),
 (4, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548313994, 'web', '105.233.48.139', None),
 (5, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548319150, 'web', '41.13.254.147', None),
 (6, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548320138, 'web', '41.13.254.147', None),
 (7, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548320199, 'web', '41.13.254.147', None),
 (8, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548320273, 'web', '41.13.254.147', None),
 (9, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548320293, 'web', '41.13.254.147', None),
 (10, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548320487, 'web', '41.13.254.147', None)]

In [47]:
%%sql
SELECT COUNT(*) FROM mdl_user

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(1052,)]

In [49]:
%%sql
SELECT COUNT(*) FROM mdl_context

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4359,)]

In [50]:
%%sql
SELECT COUNT(*) FROM mdl_course

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(15,)]

In [51]:
%%sql
SELECT COUNT(*) FROM mdl_modules

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(26,)]

In [52]:
%%sql
SELECT COUNT(*) FROM mdl_course_modules

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(290,)]

In [53]:
%%sql
SELECT COUNT(*) FROM mdl_course_modules_completion

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4483,)]

#### the number of records(columns) in each of the tables given in the MIT section

In [17]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_logstore_standard_log';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(21,)]

In [18]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_context';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(6,)]

In [19]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_user';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(15,)]

In [20]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_course';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(31,)]

In [21]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_modules';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(6,)]

In [22]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_course_modules';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(21,)]

In [23]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_course_modules_completion';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(7,)]

In [24]:
%%sql
SELECT count(*)
FROM information_schema.columns
WHERE table_name = 'mdl_grade_grades';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(23,)]

#### Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [86]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'loggedin';

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4444,)]

In [84]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'viewed'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(120167,)]

In [91]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'started'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(3679,)]

In [93]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'submitted'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(2288,)]

In [94]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'uploaded'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(173,)]

In [95]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'searched'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(14,)]

In [96]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'updated'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(9657,)]

In [97]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'resumed'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(1422,)]

In [98]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'answered'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(362,)]

In [99]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'attempted'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(0,)]

In [100]:
%%sql
SELECT COUNT(*) 
FROM mdl_logstore_standard_log 
WHERE action = 'abandoned'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(5,)]

#### Monthly usage time of learners who have confirmed and are not deleted

In [122]:
%%sql
select count(id),
EXTRACT(MONTH FROM to_timestamp(firstaccess)) AS Month
FROM mdl_user
where confirmed = 1 AND deleted = 1
group by EXTRACT(MONTH FROM to_timestamp(firstaccess));

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(8, 1.0)]

#### Number of quiz submissions by hour of day

In [ ]:
%%sql
SELECT COUNT(lastaccess - firstaccess) AS usagetime, 
    EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
        FROM mdl_user 
            WHERE confirmed = 1 AND deleted = 0 
                GROUP BY EXTRACT (MONTH FROM to_timestamp(firstaccess))

In [131]:
%%sql
SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://postgres:***@localhost/10acad_moodle
24 rows affected.

[(0.0, 29),
 (1.0, 7),
 (2.0, 14),
 (3.0, 10),
 (4.0, 18),
 (5.0, 17),
 (6.0, 34),
 (7.0, 46),
 (8.0, 69),
 (9.0, 95),
 (10.0, 88),
 (11.0, 104),
 (12.0, 90),
 (13.0, 80),
 (14.0, 68),
 (15.0, 68),
 (16.0, 70),
 (17.0, 57),
 (18.0, 55),
 (19.0, 46),
 (20.0, 53),
 (21.0, 26),
 (22.0, 23),
 (23.0, 30)]

In [136]:
%%sql
SELECT id, confirmed, deleted, lastaccess - firstaccess AS usagetime, 
EXTRACT(MONTH FROM to_timestamp (firstaccess)) AS Month 
FROM mdl_user 
WHERE confirmed = 1 AND deleted = 0
GROUP BY (EXTRACT(MONTH FROM to_timestamp (firstaccess)))
LIMIT 10;

 * postgresql://postgres:***@localhost/10acad_moodle
10 rows affected.

[(1, 1, 0, 0, 1.0),
 (20, 1, 0, 13189566, 2.0),
 (15, 1, 0, 13903766, 2.0),
 (36, 1, 0, 9586676, 2.0),
 (44, 1, 0, 10458089, 2.0),
 (8, 1, 0, 1830649, 1.0),
 (13, 1, 0, 0, 1.0),
 (98, 1, 0, 12944059, 2.0),
 (28, 1, 0, 0, 1.0),
 (12, 1, 0, 0, 1.0)]

#### CLASS

In [134]:
class DBHandler():
    def __init__(self):
        pass
    def open_local_db(self,**kwargs):
        #
        user = kwargs.get('user','postgres')
        password = kwargs.get('password', 'm0tunray0.')
        db = kwargs.get('db','10acad_moodle')
        #
        try:
            params = dict(user=user,
                          password=password,
                          host = "localhost",
                          database = db)
            proot = 'postgresql://{user}:{password}@{host}/{database}'.format(**params)
            #print(proot)
#             logger.info('Connecting to the PostgreSQL database...using sqlalchemy engine')
            engine = create_engine(proot)
            #
        except (Exception, psycopg2.Error) as error :
            logger.error(f"Error while connecting to PostgreSQL {error}")
        self.dbisopen = True
        return engine
db = DBHandler()
db.open_local_db()

Engine(postgresql://postgres:***@localhost/10acad_moodle)

In [130]:
def open_local_db(self,**kwargs):
    user = kwargs.get('user','postgres')
    db = kwargs.get('db','10acad_moodle')
    try:
        params = dict(user=user, 
                      host=localhost, 
                      database=db)
        proot = 'postgresql://{user}@{host}:5432/{database}'.format(**params)
        #print(proot)

SyntaxError: unexpected EOF while parsing (<ipython-input-130-f482571dad7b>, line 9)

#### Overall grade of learners  
#### Number of forum posts

In [107]:
%%sql
SELECT SUM(finalgrade) 
FROM public.mdl_grade_grades
LIMIT 10

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(Decimal('231922.91029'),)]

In [110]:
%%sql
SELECT COUNT(*)
FROM public.mdl_forum_posts
LIMIT 1

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(131,)]